Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Kg7b+raOW0Mvea3u7Tq+U2bKh00Hfy7n0Y+uZFyOGZjQJ1FYv3Exkox7tqVmC9jzrxC0KdTts0Z+&#13;
CkBHRBJ4RDYaoH3LbHoJFffNtMMMrGhkHhaULVt492ZVd84H+QTXtS5KdXs8D5yKsyUYosYd8Ud6&#13;
kykWbHk7PUrcxvSyOZ+LLFR9S6nEJj4kuekDZv0/Qg/bAZaZPVZCtmfWGlMOpRCRI2IIkVR27Kfq&#13;
/vR2mGmHLw+zP4nU2MYFne5BSAGeRh7wBAZwsfniemwpDbEFeA01QbPmtsyqwgpXvQtP2IOMc01K&#13;
v/bzfdncPLSdNfj8T5XdKLbhLbQ5+jnwaJHwWA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>vO0keEg0jD7IYK7wmlff23FjdwOU6vG3rYZFkiSORRKYbWljKDAWN8wRdM4NMJxjYj1pX/RMZpdw&#13;
tiBAMp+95jVxBe5mbwK1l4BSfBnViexAkEPVKl5QIXQUKb7SGc1ritOeY8bZrAZZFMwLfIyIibv5&#13;
d0TpClITxMlNJfKYS5F4rgsbweqIFGibwzlPXHSo06YLFe/2WOAUUMcfIcz2L+UGaLL1Gw6bvRNS&#13;
yTBBPCFrua9In4+TpRzazsrCuCv01suAzdqkZyORUOSUC5CwqNJb/zH6KO3PhJCd6SphpeHa828n&#13;
kiMUYdfpkj/vK6jtOBjKhEjwcb4sppbgVVzrdDYrL8io0tpoMjPHppuZblz7c7A6Cudo0IVojVM/&#13;
kvyKhfuKI5HuDC0ZdAcKXA3Tg+7IfPO4POh+ioiZ6QzDm6ekh54vVUDJ7NGGovJnvfPHPNM32uZz&#13;
EVa4XYS+KPw7/cJeik+2D99me4E3cyetn8tHnohIYoh3rJCPFkKkH0FQBNO7I2G0b3hVnA14B1Yq&#13;
/9fTma92sfkLZQ7Fg6lRLvtnr21K+He3+ZvETWulxQa6TLqPnIC8SdwmRxElwN8i+fa2atCo10JF&#13;
G3zQE40lX4QZUgSQmcoZ1F62OEm0S0xhy4SXETws0Osdv5JzCQTtq3N1jMRmikdEir8HecIWucRA&#13;
+vl4QEcBVeLosQBFYLVd8yLRKTOJ69VnrRs0VwoWnouke4UyQt8YuHbE8uFf5zFz3ddHm1GBs0lJ&#13;
scDs2tkDVuwtTo26UpryhVxGX2KyVq5NDCaghHzwqChiH4jz6XtlNDtzDMUfoXR4bLCGQ0CbHGOQ&#13;
IQqVp+OmHN54cWfdQzcCl9MXPyRe91JdzgVSuSUOipLXBTe2zxndS88QAu3+0prncWlXdZHMRP3g&#13;
Dploj4SfZmV4mDotcqQPjzh290sQPcznI3rdibG155IAMRWRsz8RN+ZotfxiOInJeVkhjlk7PgCU&#13;
oqZ0</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>MAUe7hG67IZQ9QWmh35LS8N+Fns=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
T/jLpAM+CcTOxbw9oHwV+GPyvO3cx23DSBZQh90c0W5vJakeH9KesrV1nDJfgUGvT7n9C5QrHo9U&#13;
hMP98znWMEHg2/5jv68GwpIP0as1UJOqwx8bzkU6820BfWsAazQOJ9YLRIQXiJFQx/Z0uRTKJWAn&#13;
a30mR/2L4JCMcdVCTeaSAwKpqIg0uc8rCulZN3l++6IB9EYrObFdJOy2Td0ZgwEuvc5WNZ/b9+VA&#13;
utvtvZcbXf9xsKyfILvlIJJloWk6HnNl4C3XeGOCwDaHqQOR2a9UcHaGKWVqWG8yXiorWkrBOj6u&#13;
JP/hrKStYdrBurIi8Geyh2/ObQDC9m7BCjtttQ==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>